tap "supabase/tap"
tap "withgraphite/tap"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# XML security library
brew "libxmlsec1"
# Run multiple commands in parallel
brew "mprocs"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Rust toolchain installer
brew "rustup"
# Image processing library
brew "vips"
# Tool for managing your YubiKey configuration
brew "ykman"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Supabase CLI
brew "supabase/tap/supabase"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Command-line interface for 1Password
cask "1password-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# Manages environments across the software lifecycle
cask "flox"
# Replacement for Docker Desktop
cask "orbstack"
# Store SSH keys in the Secure Enclave
cask "secretive"
cargo "sqlx-cli"
